tutorials/incompressible/pimpleDyMFoam/movingCone/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     5.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    movingWall
    {
        type            fixedValue;
        value           uniform (1 0 0);
    }

    farFieldMoving
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    fixedWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    axis
    {
        type            symmetryPlane;
    }

    left
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }

    farField
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    back
    {
        type            wedge;
    }

    front
    {
        type            wedge;
    }
}

// ************************************************************************* //
